import 'package:flutter/material.dart';

import 'about_us_paragraph.dart';

List<String> aboutUsList = [
  'نحن خدمة متخصصة في بيع وتوصيل الفواكه الطازجة إلى باب منزلك، ونسعى إلى تقديم تجربة تسوق سهلة، سريعة، وآمنة تساعدك على الاهتمام بصحتك ونمط حياتك الصحي دون أي عناء.',
  'نؤمن بأن الجودة تبدأ من المصدر، لذلك نحرص على اختيار أفضل أنواع الفواكه بعناية من موردين موثوقين يلتزمون بأعلى معايير الجودة والطزاجة. يتم فحص المنتجات قبل توصيلها لضمان وصولها إليك بحالة ممتازة وطعم طبيعي مميز.',
  'من خلال تطبيقنا، يمكنك تصفح مجموعة متنوعة من الفواكه الطازجة، اختيار الكميات التي تناسب احتياجاتك، وإتمام عملية الشراء بكل سهولة وفي أي وقت. تم تصميم التطبيق بواجهة بسيطة وسلسة لتجعل تجربة التسوق مريحة وسريعة لجميع المستخدمين.',
  'نوفر لك طرق دفع مرنة تناسب الجميع، حيث يمكنك الدفع إلكترونيًا بشكل آمن، أو اختيار الدفع عند استلام الطلب بكل راحة. كما نلتزم بتوصيل الطلبات في الوقت المحدد باستخدام وسائل نقل مناسبة تحافظ على جودة الفواكه ونضارتها حتى تصل إليك.',
  'نعتمد على نظام توصيل منظم يضمن التعامل مع الطلبات بعناية منذ لحظة تجهيزها وحتى تسليمها، مع الاهتمام بأدق التفاصيل لضمان سلامة المنتجات ورضا العملاء.',
  'نحرص على تقديم أسعار مناسبة وعروض مستمرة لتلبية احتياجات جميع الأسر، مع الحفاظ على أعلى مستوى من الجودة والخدمة.',
  'فريق العمل لدينا جاهز دائمًا لدعمك والرد على استفساراتك، ونسعد بتلقي ملاحظاتك واقتراحاتك لتحسين تجربتك معنا.',
  'رضا عملائنا هو هدفنا الأول، ولذلك نعمل باستمرار على تحسين خدماتنا وتطوير التطبيق بناءً على ملاحظاتكم واقتراحاتكم. نسعى لبناء علاقة ثقة طويلة الأمد مع عملائنا، وأن نكون خياركم الأول لتوصيل الفواكه الطازجة إلى منازلكم بكل سهولة وأمان 🍎🍓',
];

class AboutUsViewBody extends StatelessWidget {
  const AboutUsViewBody({super.key});

  @override
  Widget build(BuildContext context) {
    return ListView.builder(
      itemCount: aboutUsList.length,
      itemBuilder: (context, index) =>
          AboutUsParagraph(text: aboutUsList[index], index: index + 1),
    );
  }
}
